test-suite/performance/website-load-test.yml
config:
  target: "https://clickflash-website.pages.dev"
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 120
      arrivalRate: 50
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      User-Agent: "Artillery Load Test"

scenarios:
  - name: "Homepage Load"
    weight: 40
    requests:
      - get:
          url: "/"
          capture:
            - header: "content-length"
              as: "contentLength"

  - name: "Pricing Page"
    weight: 20
    requests:
      - get:
          url: "/pricing"

  - name: "Contact Page"
    weight: 15
    requests:
      - get:
          url: "/contact"

  - name: "Blog Pages"
    weight: 15
    requests:
      - get:
          url: "/blog"
      - get:
          url: "/blog/1"

  - name: "API Health Check"
    weight: 10
    requests:
      - get:
          url: "/api/health"

  - name: "Full User Journey"
    weight: 5
    requests:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/pricing"
      - think: 3
      - get:
          url: "/contact"
      - think: 1
      - post:
          url: "/api/contact"
          json:
            name: "Load Test User"
            email: "load@test.com"
            message: "This is a load test message"